//
//  PickerItems.swift
//  MatchingApp
//
//  Created by Rio Nagasaki on 2023/06/07.
//

import Foundation

class PickerItems {
    static let activeRegion = ["-","渋谷", "新宿", "池袋", "新大久保", "高田馬場", "上野"]
    
    static let birthPlace = ["-","海外","北海道", "青森県", "岩手県", "宮城県", "秋田県", "山形県", "福島県", "茨城県", "栃木県", "群馬県", "埼玉県", "千葉県", "東京都", "神奈川県", "新潟県", "富山県", "石川県", "福井県", "山梨県", "長野県", "岐阜県", "静岡県", "愛知県", "三重県", "滋賀県", "京都府", "大阪府", "兵庫県", "奈良県", "和歌山県", "鳥取県", "島根県", "岡山県", "広島県", "山口県", "徳島県", "香川県", "愛媛県", "高知県", "福岡県", "佐賀県", "長崎県", "熊本県", "大分県", "宮崎県", "鹿児島県", "沖縄県"]
    
    static let educationalBackground = ["-","高校卒", "短大/専門学校卒", "大学卒", "大学院卒", "その他"]
    
    static let work = ["-","大学生", "大学院生", "専門学生・短大生・高専生", "流通", "食料・飲料", "製薬", "医療", "福祉・介護"]
    
    static let heights = [
        "-","130cm以下", "131cm", "132cm", "133cm", "134cm", "135cm",
        "136cm", "137cm", "138cm", "139cm", "140cm", "141cm",
        "142cm", "143cm", "144cm", "145cm", "146cm", "147cm",
        "148cm", "149cm", "150cm", "151cm", "152cm", "153cm",
        "154cm", "155cm", "156cm", "157cm", "158cm", "159cm",
        "160cm", "161cm", "162cm", "163cm", "164cm", "165cm",
        "166cm", "167cm", "168cm", "169cm", "170cm", "171cm",
        "172cm", "173cm", "174cm", "175cm", "176cm", "177cm",
        "178cm", "179cm", "180cm", "181cm", "182cm", "183cm",
        "184cm", "185cm", "186cm", "187cm", "188cm", "189cm",
        "190cm", "191cm", "192cm", "193cm", "194cm", "195cm",
        "196cm", "197cm", "198cm", "199cm", "200cm", "201cm",
        "202cm", "203cm", "204cm", "205cm", "206cm", "207cm",
        "208cm", "209cm", "210cm", "211cm", "212cm", "213cm",
        "214cm", "215cm以上"
    ]
    
    static let weights = [
       "-","細め", "スレンダー", "普通", "グラマー", "ぽっちゃり", "がっしり", "マッチョ", "太め"
    ]
    
    static let bloodType = [
       "-","A", "B", "O", "AB", "不明"
    ]
    
    static let purpose = [
      "-","恋人探し","友達作り","特に決めてない"
    ]
    
    static let cigarettes = [
        "-","吸わない", "吸う", "吸う(電子タバコ)", "ときどき吸う", "非喫煙者の前では吸わない", "相手が嫌ならやめる"
    ]
    
    static let liquor = [
       "-","よく飲む", "ときどき飲む", "あまり飲まない", "全く飲まない"
    ]
    
    static let datingExpenses = [
       "-","男性側がすべて払う", "男性側が多めに払う", "女性側がすべて払う", "女性側が多めに払う", "割り勘", "持ってる方が払う", "相手と相談して決める"
    ]
}
