//
//  PickerItems.swift
//  MatchingApp
//
//  Created by Rio Nagasaki on 2023/06/07.
//

import Foundation

struct PickerItems {
    static let activeRegion = ["-","渋谷", "新宿", "池袋", "新大久保", "高田馬場", "上野"]
    
    static let birthPlace = ["-","海外","北海道", "青森県", "岩手県", "宮城県", "秋田県", "山形県", "福島県", "茨城県", "栃木県", "群馬県", "埼玉県", "千葉県", "東京都", "神奈川県", "新潟県", "富山県", "石川県", "福井県", "山梨県", "長野県", "岐阜県", "静岡県", "愛知県", "三重県", "滋賀県", "京都府", "大阪府", "兵庫県", "奈良県", "和歌山県", "鳥取県", "島根県", "岡山県", "広島県", "山口県", "徳島県", "香川県", "愛媛県", "高知県", "福岡県", "佐賀県", "長崎県", "熊本県", "大分県", "宮崎県", "鹿児島県", "沖縄県"]
    
    static let educationalBackground = ["-","高校卒", "短大/専門学校卒", "大学卒", "大学院卒", "その他"]
    
    static let work = ["-","大学生", "大学院生", "専門学生・短大生・高専生", "流通", "食料・飲料", "製薬", "医療", "福祉・介護"]
    
    static let heights = [
        "-","130cm以下", "131cm", "132cm", "133cm", "134cm", "135cm",
        "136cm", "137cm", "138cm", "139cm", "140cm", "141cm",
        "142cm", "143cm", "144cm", "145cm", "146cm", "147cm",
        "148cm", "149cm", "150cm", "151cm", "152cm", "153cm",
        "154cm", "155cm", "156cm", "157cm", "158cm", "159cm",
        "160cm", "161cm", "162cm", "163cm", "164cm", "165cm",
        "166cm", "167cm", "168cm", "169cm", "170cm", "171cm",
        "172cm", "173cm", "174cm", "175cm", "176cm", "177cm",
        "178cm", "179cm", "180cm", "181cm", "182cm", "183cm",
        "184cm", "185cm", "186cm", "187cm", "188cm", "189cm",
        "190cm", "191cm", "192cm", "193cm", "194cm", "195cm",
        "196cm", "197cm", "198cm", "199cm", "200cm", "201cm",
        "202cm", "203cm", "204cm", "205cm", "206cm", "207cm",
        "208cm", "209cm", "210cm", "211cm", "212cm", "213cm",
        "214cm", "215cm以上"
    ]
    
    static let weights = [
       "-","細め", "スレンダー", "普通", "グラマー", "ぽっちゃり", "がっしり", "マッチョ", "太め"
    ]
    
    static let bloodType = [
       "-","A", "B", "O", "AB", "不明"
    ]
    
    static let purpose = [
      "-","恋人探し","友達作り","特に決めてない"
    ]
    
    static let cigarettes = [
        "-","吸わない", "吸う", "吸う(電子タバコ)", "ときどき吸う", "非喫煙者の前では吸わない", "相手が嫌ならやめる"
    ]
    
    static let liquor = [
       "-","よく飲む", "ときどき飲む", "あまり飲まない", "全く飲まない"
    ]
    
    static let datingExpenses = [
       "-","男性側がすべて払う", "男性側が多めに払う", "女性側がすべて払う", "女性側が多めに払う", "割り勘", "持ってる方が払う", "相手と相談して決める"
    ]
    
    static let hobbies = [
        "お酒", "飲み会","韓国料理","中華料理","インド料理","スイーツ好き","食べる専門","食べ歩き","自炊っ子","焼肉","お菓子作り","アートイベント巡り","シーシャ","タバコ", "アニメ","ゲーム","APEX","漫画", "コーヒー", "カフェ", "カラオケ","音楽","邦ロック","HIPHOP","K-POP", "スポーツ観戦", "読書", "スノボ", "旅行", "サウナ","映画鑑賞", "バスケ", "野球", "サッカー", "ラグビー","スキンケア", "ポエム", "ファッション", "ジム", "散歩","筋トレ", "スポーツカー","法律", "経済学", "TOEIC","ダンス", "バレエ", "ジャズ", "クラシック音楽", "クッキング",
        "ワイン", "ビール", "クラフトビール", "ティータイム", "紅茶",
        "抹茶", "登山", "キャンプ", "ハイキング", "ボルダリング",
        "スキューバダイビング", "ヨガ", "瞑想", "フィットネス", "サイクリング",
        "ハンドメイド", "DIY", "ガーデニング", "インテリア", "写真撮影",
        "ドローン", "プログラミング", "語学学習", "英会話", "ボランティア",
        "チャリティ", "アーユルヴェーダ", "トレイルランニング", "ジョギング", "アクアリウム",
        "グラフィックデザイン", "ウェブデザイン", "デジタルアート", "ペインティング", "絵画教室",
        "ポットリー", "セラミックアート", "木工", "宝石・ジュエリー作り", "クロスステッチ",
        "クロッシェ", "刺繍", "パズル", "将棋", "チェス",
        "ビリヤード", "ダーツ", "麻雀", "ボードゲーム", "カードゲーム",
        "VRゲーム", "空手", "柔道", "剣道", "弓道",
        "茶道", "華道", "書道", "ペットケア", "鳥ウォッチング",
        "スタンプコレクション", "コインコレクション", "レトロゲーム", "バーチャルリアルティ", "ワークアウト",
        "ゾンビ映画", "ホラー映画", "SF映画", "ドキュメンタリー", "ミュージカル",
        "オペラ", "劇場", "コンサート", "ライブハウス", "フェス",
        "ドラム", "ギター", "ピアノ", "バイオリン", "マラソン",
        "トライアスロン", "バドミントン", "テニス", "卓球", "ゴルフ",
        "スケートボード", "サーフィン", "ウィンドサーフィン", "パラグライディング", "グライダー",
        "騎馬", "フィッシング", "釣り", "鳥瞰", "天文学",
        "占星術", "タロット", "読唇術", "心理学", "哲学",
        "宗教", "瞑想", "チャクラ", "リーディング", "マッサージ",
        "アロマテラピー", "フラワーアレンジメント", "マジック", "ジャグリング","天体観測", "バードウォッチング", "ハーブ園芸", "石彫り", "コラージュ",
        "バードウォッチング", "アイスクリーム作り", "ブレッドメイキング", "宝石収集", "ミネラル収集",
        "ビデオ編集", "アニメーション制作", "3Dプリンティング", "ロボット製作", "電子工作",
        "チーズ作り", "ビール醸造", "ワイン作り", "果樹園芸", "海水魚飼育",
        "ラジオDJ", "ポッドキャスティング", "ドキュメンタリー制作", "ストリートアート", "バルーンアート",
        "魔法学", "神話学", "民俗学", "歴史", "考古学",
        "ハイキング", "カヌー", "カヤック", "ロッククライミング", "スペルンキング",
        "BMX", "モトクロス", "ダウンヒルスキー", "フリースタイルスキー", "アイスクライミング",
        "ベリーダンス", "タンゴ", "サルサ", "フラメンコ", "カポエイラ",
        "リズムゲーム", "テーブルトークRPG", "実況プレイ", "フィギュア収集", "レトロコンソール収集",
        "ジグソーパズル", "クロスワードパズル", "スーダク", "ノンスリーパーゲーム", "マインドフルネス",
        "絵本収集", "ハイキュー", "ビーチバレー", "バレーボール", "フィギュアスケート",
        "スピードスケート", "カーリング", "リュージュ", "ボブスレー", "スケルトン",
        "パラセーリング", "スカイダイビング", "ベースジャンプ", "ハンググライディング", "パラグライディング",
        "ブラックホール探求", "素粒子物理学", "生態学", "地質学", "気象学",
        "宇宙科学", "天文学", "ゲノム学", "古生物学", "植物学",
        "ボディービルディング", "カリステニクス", "タイチ", "キックボクシング", "ムエタイ",
        "ブラジリアン柔術", "合気道", "空手道", "テコンドー", "クラヴマガ",
        "料理教室", "パン教室", "餅つき", "食品サンプル作り", "ポップアート",
        "美術館巡り", "古美術鑑賞", "古書収集", "郷土史研究", "言語学",
        "フランス語", "スペイン語", "ドイツ語", "イタリア語", "ロシア語",
        "アラビア語", "ヒンディー語", "中国語", "韓国語", "日本語教育",
        "パントマイム", "即興コメディ", "落語", "古典音楽", "民族音楽",
        "ワールドミュージック", "エレクトロニカ", "EDM", "R&B", "ジャズミュージック",
        "クラフト", "ペーパークラフト", "オリガミ", "切り絵", "ミニチュア作成",
        "スタンプ制作", "グリーティングカード制作", "クイリング", "ビーズアート", "刺し子",
        "旧車収集", "ミニカーコレクション", "ドールハウス制作", "飛行機模型", "鉄道模型",
        "船模型", "バイクツーリング", "古時計修理", "アンティーク収集", "レコード収集"
    ]
}
