//
//  PickerItems.swift
//  MatchingApp
//
//  Created by Rio Nagasaki on 2023/06/07.
//

import Foundation

struct PickerItems {
    static let base = [
        "初心者", "通話歓迎", "通話お断り", "暇人", "いろんな人と仲良く", "低浮上",
    ]
    
    static let status = [
        "就活中","浪人中", "受験生","大学生", "高校生","大学院生", "社会人","会社経営", "フリーター", "バイト","彼氏いる", "彼女いる", "既婚", "恋人募集中"
    ]
    
    static let playing = ["居酒屋", "カラオケ", "ダーツ", "競馬", "競輪", "推し活", "競艇", "ライブ参戦", "夏フェス", "ナイトプール", "hub", "バー", "ゲームセンター", "漫画喫茶","Youtube","TikTok","instagram" ,"ホテル", "鉄道","天体", "博物館" ,"ショッピング", "コストコ", "スタバ","スイーツ", "食べ歩き","サイゼ", "ディズニー","ユニバ","絶叫系","ラウンドワン", "スポーツ観戦","旅行","サウナ","温泉" ,"筋トレ","キャンプ", "釣り", "ブランド"]
    
    static let study = ["国語", "古典", "哲学", "言語学","法学", "経営学","社会学","地政学","英語", "心理学", "数学", "物理学", "経済学", "情報科学", "プログラミング言語学","電子工作", "化学", "歴史", "マーケティング", "資格取得"]
    
    static let skills = [
        "イケボ", "萌ボ", "優しい", "積極的", "消極的", "根暗", "愛嬌"
    ]
    
    static let emoji = ["😄","🥺","😇","😎","😮‍💨","🤣","💻","👊","👿","👼","📞","💤","🎉","🎤", "💩", "🎈","🍿","🎬","📸","🎡","💋","🇺🇸", "🇨🇳", "🇯🇵", "🇰🇷", "🇧🇷","🇨🇦"]
    
    
}
